In [2]:
import pandas as pd
import numpy as np

ventes = pd.DataFrame({
    'vendeur': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve', 'Frank'],
    'region': ['Nord', 'Sud', 'Nord', 'Est', 'Sud', 'Est'],
    'ventes_q1': [15000, 23000, 18000, np.nan, 21000, 19000],
    'ventes_q2': [17000, 19000, 22000, 25000, np.nan, 21000],
    'ventes_q3': [14000, 25000, 20000, 23000, 24000, 18000]
}, index=['V001', 'V002', 'V003', 'V004', 'V005', 'V006'])

print(ventes)

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V001    Alice   Nord    15000.0    17000.0      14000
V002      Bob    Sud    23000.0    19000.0      25000
V003  Charlie   Nord    18000.0    22000.0      20000
V004    Diana    Est        NaN    25000.0      23000
V005      Eve    Sud    21000.0        NaN      24000
V006    Frank    Est    19000.0    21000.0      18000

Niveau 1 - Facile üü¢
Exercice 1
Trie le DataFrame par index (ordre croissant).

Exercice 2
Trie le DataFrame par index d√©croissant.

Exercice 3
Trie les colonnes par ordre alphab√©tique.

Exercice 4
Trie le DataFrame par ventes_q1 (croissant).

Exercice 5
Trie le DataFrame par ventes_q3 (d√©croissant).

Niveau 2 - Interm√©diaire üü°
Exercice 6
Trie par r√©gion puis par ventes_q1.

Exercice 7
Trie par r√©gion (croissant) et ventes_q2 (d√©croissant).

Exercice 8
Trie par ventes_q1 en mettant les NaN en premier.

Exercice 9
Cr√©e une Series avec les ventes_q3 et calcule le rang de chaque vendeur.

Exercice 10
Calcule le rang des ventes_q1 avec la m√©thode 'min' pour les √©galit√©s.

Niveau 3 - Avanc√© üî¥
Exercice 11
Ajoute une colonne rang_q3 qui contient le classement des vendeurs selon ventes_q3 (1 = meilleur).

Exercice 12
Trie le DataFrame pour avoir les 3 meilleurs vendeurs en ventes_q2.

Exercice 13
Calcule le rang moyen de chaque vendeur sur les 3 trimestres.

In [3]:
# Exercice 1 Tri par index croissant
ventes.sort_index()

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V001    Alice   Nord    15000.0    17000.0      14000
V002      Bob    Sud    23000.0    19000.0      25000
V003  Charlie   Nord    18000.0    22000.0      20000
V004    Diana    Est        NaN    25000.0      23000
V005      Eve    Sud    21000.0        NaN      24000
V006    Frank    Est    19000.0    21000.0      18000

In [4]:
# Exercice 2 tri par index d√©croissant
ventes.sort_index(ascending=False)

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V006    Frank    Est    19000.0    21000.0      18000
V005      Eve    Sud    21000.0        NaN      24000
V004    Diana    Est        NaN    25000.0      23000
V003  Charlie   Nord    18000.0    22000.0      20000
V002      Bob    Sud    23000.0    19000.0      25000
V001    Alice   Nord    15000.0    17000.0      14000

In [5]:
# Exercice 3 Tri colonnes alphab√©tique
ventes.sort_index(axis=1)

     region  vendeur  ventes_q1  ventes_q2  ventes_q3
V001   Nord    Alice    15000.0    17000.0      14000
V002    Sud      Bob    23000.0    19000.0      25000
V003   Nord  Charlie    18000.0    22000.0      20000
V004    Est    Diana        NaN    25000.0      23000
V005    Sud      Eve    21000.0        NaN      24000
V006    Est    Frank    19000.0    21000.0      18000

In [6]:
# Exercice 4 tri par ventes_q1 croissant
ventes.sort_values('ventes_q1')

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V001    Alice   Nord    15000.0    17000.0      14000
V003  Charlie   Nord    18000.0    22000.0      20000
V006    Frank    Est    19000.0    21000.0      18000
V005      Eve    Sud    21000.0        NaN      24000
V002      Bob    Sud    23000.0    19000.0      25000
V004    Diana    Est        NaN    25000.0      23000

In [7]:
# Exercice 5 Tri par ventes_q3 d√©croissant
ventes.sort_values('ventes_q3', ascending=False)

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V002      Bob    Sud    23000.0    19000.0      25000
V005      Eve    Sud    21000.0        NaN      24000
V004    Diana    Est        NaN    25000.0      23000
V003  Charlie   Nord    18000.0    22000.0      20000
V006    Frank    Est    19000.0    21000.0      18000
V001    Alice   Nord    15000.0    17000.0      14000

In [8]:
# Exercice 6 Tri par r√©gion puis ventes_q1
ventes.sort_values(['region', 'ventes_q1'])

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V006    Frank    Est    19000.0    21000.0      18000
V004    Diana    Est        NaN    25000.0      23000
V001    Alice   Nord    15000.0    17000.0      14000
V003  Charlie   Nord    18000.0    22000.0      20000
V005      Eve    Sud    21000.0        NaN      24000
V002      Bob    Sud    23000.0    19000.0      25000

In [9]:
# Exercice 7 R√©gion croissant, ventes_q2 d√©croissant
ventes.sort_values(['region', 'ventes_q2'], ascending=[True, False])

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V004    Diana    Est        NaN    25000.0      23000
V006    Frank    Est    19000.0    21000.0      18000
V003  Charlie   Nord    18000.0    22000.0      20000
V001    Alice   Nord    15000.0    17000.0      14000
V002      Bob    Sud    23000.0    19000.0      25000
V005      Eve    Sud    21000.0        NaN      24000

In [10]:
# Exercice 8 NaN en premier
ventes.sort_values('ventes_q1', na_position='first')

      vendeur region  ventes_q1  ventes_q2  ventes_q3
V004    Diana    Est        NaN    25000.0      23000
V001    Alice   Nord    15000.0    17000.0      14000
V003  Charlie   Nord    18000.0    22000.0      20000
V006    Frank    Est    19000.0    21000.0      18000
V005      Eve    Sud    21000.0        NaN      24000
V002      Bob    Sud    23000.0    19000.0      25000

In [11]:
# Exercice 9 Rang ventes_q3
ventes['ventes_q3'].rank(ascending=False)

V001    6.0
V002    1.0
V003    4.0
V004    3.0
V005    2.0
V006    5.0
Name: ventes_q3, dtype: float64

In [12]:
# Exercice 10, Rang m√©thode min
ventes['ventes_q1'].rank(method='min')

V001    1.0
V002    5.0
V003    2.0
V004    NaN
V005    4.0
V006    3.0
Name: ventes_q1, dtype: float64

In [15]:
# Exercice 11 Colonne rang_q3
ventes['rang_q3'] = ventes['ventes_q3'].rank(ascending=False)
ventes

      vendeur region  ventes_q1  ventes_q2  ventes_q3  rang_q3
V001    Alice   Nord    15000.0    17000.0      14000      6.0
V002      Bob    Sud    23000.0    19000.0      25000      1.0
V003  Charlie   Nord    18000.0    22000.0      20000      4.0
V004    Diana    Est        NaN    25000.0      23000      3.0
V005      Eve    Sud    21000.0        NaN      24000      2.0
V006    Frank    Est    19000.0    21000.0      18000      5.0

In [18]:
# Exercice 12 Top 3 ventes_q2
ventes.sort_values('ventes_q2', ascending=False).head(3)

      vendeur region  ventes_q1  ventes_q2  ventes_q3  rang_q3
V004    Diana    Est        NaN    25000.0      23000      3.0
V003  Charlie   Nord    18000.0    22000.0      20000      4.0
V006    Frank    Est    19000.0    21000.0      18000      5.0

In [19]:
# Exercice 13 Rang moyen sur 3 trimestres
rang_q1 = ventes['ventes_q1'].rank(ascending=False)
rang_q2 = ventes['ventes_q2'].rank(ascending=False)
rang_q3 = ventes['ventes_q3'].rank(ascending=False)

rang_moyen = (rang_q1 + rang_q2 + rang_q3) / 3
print(rang_moyen)

V001    5.333333
V002    2.000000
V003    3.333333
V004         NaN
V005         NaN
V006    3.666667
dtype: float64